[
  {
    "titulo": "Product Owner",
    "pergunta": "Qual é a principal responsabilidade do Product Owner dentro de um time Scrum?",
    "alternativas": [
      {"letra": "A", "texto": "Organizar as reuniões de Sprint Planning"},
      {"letra": "B", "texto": "Garantir que os testes sejam executados corretamente"},
      {"letra": "C", "texto": "Gerenciar o Product Backlog e maximizar o valor do produto"},
      {"letra": "D", "texto": "Supervisionar tecnicamente a equipe de desenvolvimento"}
    ],
    "resposta_correta": "C"
  },
  {
    "titulo": "Product Owner",
    "pergunta": "O que o Product Owner deve fazer ao longo do projeto com as partes interessadas (stakeholders)?",
    "alternativas": [
      {"letra": "A", "texto": "Enviar relatórios semanais"},
      {"letra": "B", "texto": "Evitar interferência com os planos da equipe"},
      {"letra": "C", "texto": "Manter comunicação frequente, entender necessidades e influenciar decisões"},
      {"letra": "D", "texto": "Permitir que as partes interessadas alterem o Product Backlog livremente"}
    ],
    "resposta_correta": "C"
  },
  {
    "titulo": "Product Owner",
    "pergunta": "O que é a Visão do Produto e qual o papel do Product Owner em relação a ela?",
    "alternativas": [
      {"letra": "A", "texto": "Uma meta técnica criada pelo time de desenvolvimento"},
      {"letra": "B", "texto": "Um direcionamento estratégico criado e mantido pelo PO para guiar o desenvolvimento"},
      {"letra": "C", "texto": "Um documento fixo definido no início do projeto"},
      {"letra": "D", "texto": "Uma lista de funcionalidades a serem entregues"}
    ],
    "resposta_correta": "B"
  },
  {
    "titulo": "Product Owner",
    "pergunta": "Como o Product Owner colabora com o Time de Desenvolvimento durante um Sprint?",
    "alternativas": [
      {"letra": "A", "texto": "Exige relatórios diários de progresso"},
      {"letra": "B", "texto": "Está acessível para esclarecimentos e participa do refinamento do backlog"},
      {"letra": "C", "texto": "Define sozinho os itens do Sprint Backlog"},
      {"letra": "D", "texto": "Solicita mudanças na meta do Sprint a qualquer momento"}
    ],
    "resposta_correta": "B"
  },
  {
    "titulo": "Product Owner",
    "pergunta": "Quando o Product Owner pode aceitar ou rejeitar as entregas do time?",
    "alternativas": [
      {"letra": "A", "texto": "Durante a reunião diária (Daily Scrum)"},
      {"letra": "B", "texto": "Ao final do Sprint Planning"},
      {"letra": "C", "texto": "Na Sprint Review, com base na Definição de Pronto e Critérios de Aceitação"},
      {"letra": "D", "texto": "Apenas após validação externa com o cliente final"}
    ],
    "resposta_correta": "C"
  },
  {
    "titulo": "Scrum Master",
    "pergunta": "Qual das alternativas representa corretamente o papel do Scrum Master dentro de um time Scrum?",
    "alternativas": [
      {"letra": "A", "texto": "Gerenciar o cronograma e distribuir tarefas à equipe"},
      {"letra": "B", "texto": "Facilitar processos e remover impedimentos"},
      {"letra": "C", "texto": "Tomar decisões técnicas sobre o produto"},
      {"letra": "D", "texto": "Aprovar ou rejeitar os entregáveis do Sprint"}
    ],
    "resposta_correta": "B"
  },
  {
    "titulo": "Scrum Master",
    "pergunta": "O que significa dizer que o Scrum Master é 'neutro'?",
    "alternativas": [
      {"letra": "A", "texto": "Ele não participa das reuniões de planejamento, seu papel é de observador"},
      {"letra": "B", "texto": "Ele não interfere nas decisões do time, mas foca em facilita-las"},
      {"letra": "C", "texto": "Ele assume um papel decisório sobre prazos e metas"},
      {"letra": "D", "texto": "Ele atua como gerente do projeto e do time"}
    ],
    "resposta_correta": "B"
  },
  {
    "titulo": "Scrum Master",
    "pergunta": "O que o Scrum Master faz ao identificar um impedimento que o Time de Desenvolvimento não consegue resolver?",
    "alternativas": [
      {"letra": "A", "texto": "Solicita ao Product Owner que o resolva"},
      {"letra": "B", "texto": "Ignora, pois problemas são de responsabilidade do time"},
      {"letra": "C", "texto": "Remove o impedimento ou mobiliza recursos para removê-lo"},
      {"letra": "D", "texto": "Suspende o Sprint até o problema ser resolvido"}
    ],
    "resposta_correta": "C"
  },
  {
    "titulo": "Scrum Master",
    "pergunta": "Como o Scrum Master contribui para aumentar a autonomia do time?",
    "alternativas": [
      {"letra": "A", "texto": "Tomando decisões no lugar do time para ganhar agilidade, assumindo assim o seu papel de líder"},
      {"letra": "B", "texto": "Estabelecendo normas fixas e controlando sua execução"},
      {"letra": "C", "texto": "Ensinando o time a se auto-organizar e tomar decisões com base em informações transparentes"},
      {"letra": "D", "texto": "Atendendo diretamente às demandas dos stakeholders no lugar do PO"}
    ],
    "resposta_correta": "C"
  },
  {
    "titulo": "Scrum Master",
    "pergunta": "Qual é a abordagem correta do Scrum Master para garantir que os eventos do Scrum (como a Daily Scrum) aconteçam?",
    "alternativas": [
      {"letra": "A", "texto": "Lembrar o time diariamente do horário da reunião"},
      {"letra": "B", "texto": "Deixar que o Product Owner lidere os eventos"},
      {"letra": "C", "texto": "Orientar e capacitar o time para se auto-organizar e conduzir os eventos"},
      {"letra": "D", "texto": "Coordenar todas as reuniões e tomar notas para documentação"}
    ],
    "resposta_correta": "C"
  },
  {
    "titulo": "Time de Desenvolvimento",
    "pergunta": "Qual das alternativas descreve corretamente o Time de Desenvolvimento no Scrum?",
    "alternativas": [
      {"letra": "A", "texto": "Um time multidisciplinar e auto-organizado, responsável por entregar incrementos do produto com valor"},
      {"letra": "B", "texto": "Um conjunto de desenvolvedores que executam apenas tarefas atribuídas pelo Scrum Master"},
      {"letra": "C", "texto": "Um grupo de especialistas liderado por um gerente de projeto"},
      {"letra": "D", "texto": "Um time que depende do Product Owner para planejar tecnicamente o desenvolvimento do produto"}
    ],
    "resposta_correta": "A"
  },
  {
    "titulo": "Time de Desenvolvimento",
    "pergunta": "Sobre o planejamento do trabalho durante o Sprint, é correto afirmar que:",
    "alternativas": [
      {"letra": "A", "texto": "O Product Owner define como os itens do Sprint Backlog serão desenvolvidos"},
      {"letra": "B", "texto": "O Scrum Master divide as tarefas entre os membros do time"},
      {"letra": "C", "texto": "O planejamento é feito por um gerente externo, com base na meta do Product Owner"},
      {"letra": "D", "texto": "O Time de Desenvolvimento define como o trabalho será realizado, após negociar com o Product Owner o que será feito"}
    ],
    "resposta_correta": "D"
  },
  {
    "titulo": "Time de Desenvolvimento",
    "pergunta": "O que caracteriza um impedimento para o Time de Desenvolvimento?",
    "alternativas": [
      {"letra": "A", "texto": "Qualquer dúvida técnica durante o desenvolvimento"},
      {"letra": "B", "texto": "Um obstáculo significativo que impede ou atrasa o trabalho e que o time não consegue resolver sozinho"},
      {"letra": "C", "texto": "Problemas do dia a dia facilmente resolvidos pelo próprio time"},
      {"letra": "D", "texto": "Falta de motivação por parte de algum membro da equipe"}
    ],
    "resposta_correta": "B"
  },
  {
    "titulo": "Time de Desenvolvimento",
    "pergunta": "Em relação à auto-organização, é correto afirmar que o Time de Desenvolvimento:",
    "alternativas": [
      {"letra": "A", "texto": "Atua de forma isolada, sem considerar metas ou regras da organização"},
      {"letra": "B", "texto": "É autônomo, mas depende do Product Owner para decidir como realizar as tarefas"},
      {"letra": "C", "texto": "Gerencia seu próprio trabalho, colaborativamente, com foco nas metas e alinhado com a organização"},
      {"letra": "D", "texto": "Se auto-organiza apenas nas reuniões de Daily Scrum"}
    ],
    "resposta_correta": "C"
  },
  {
    "titulo": "Time de Desenvolvimento",
    "pergunta": "Qual o foco principal do Time de Desenvolvimento durante um Sprint?",
    "alternativas": [
      {"letra": "A", "texto": "Cumprir todas as tarefas planejadas, independentemente da meta"},
      {"letra": "B", "texto": "Produzir o máximo de código possível"},
      {"letra": "C", "texto": "Realizar tarefas atribuídas pelo Scrum Master"},
      {"letra": "D", "texto": "Atingir a Meta do Sprint, entregando valor ao cliente com qualidade"}
    ],
    "resposta_correta": "D"
  }
]
